Statistical significance
* Whether an experiment yields a result more extreme than what chance might produce, thus is beyond the chance variation, and said to be statistically significant.

P-value
* The probability of obtaining results as unusual or extreme as the observed results

Alpha
* the probability that chance results must surpass for actual outcomes to be deemed statistically significant

Type 1 error
* Concluding an effect is present when it is not

Type 2 error
* Concluding an effect is not present when it is

In [44]:
import pandas as pd
import numpy as np

In [45]:
data = pd.read_csv("/home/satire/PycharmProjects/Statistics/csv/social_ads.csv")
data

     Age  EstimatedSalary  Purchased
0     19            19000          0
1     35            20000          0
2     26            43000          0
3     27            57000          0
4     19            76000          0
..   ...              ...        ...
395   46            41000          1
396   51            23000          1
397   50            20000          1
398   36            33000          0
399   49            36000          1

[400 rows x 3 columns]

In [46]:
data.isna().sum()

Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [47]:
labels = ['11-20', '21-30', '31-40', '41-50', '51-60', '+61']
bins = [10, 20, 30, 40, 50, 60, float('inf')]
data['Age_Group'] = pd.cut(data['Age'], bins=bins, labels=labels, right=False)
each = data['Age_Group'].value_counts().reindex(labels)

In [48]:
tab = pd.crosstab(data['Age_Group'], data['Purchased'])
tab

Purchased    0   1
Age_Group
11-20       12   0
21-30       84   4
31-40      106  32
41-50       50  59
51-60        5  41
+61          0   7